---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisMode
source: html/269268a2-ae49-9029-18f8-31e57bdcaa8d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisMode Property

"Mode"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisMode { get; }
```